app/controllers/answers_controller.rb

SELECT "answers".* FROM "answers"
---
  def index
    @answers = Answer.all

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def new
    @question = Question.find params[:question_id]