app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions"  WHERE "questions"."user_id" = $1 LIMIT 5 OFFSET 0  [["user_id", 6]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 6  ORDER BY "users"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "questions"  WHERE "questions"."user_id" = $1  [["user_id", 6]]
SELECT  "questions".* FROM "questions"  LIMIT 30 OFFSET 0
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "questions"
---
  def index
    if params[:user_id]
      @questions = User.find(params[:user_id]).questions.paginate(:page => params[:page], :per_page => 5)
    else
      @questions = Question.paginate(:page => params[:page], :per_page => 5)

INSERT INTO "questions" ("created_at", "description", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2015-05-07 06:16:13.339765"], ["description", "f"], ["title", "f"], ["updated_at", "2015-05-07 06:16:13.339765"], ["user_id", 2]]
---
  def create
    @question = Question.new(user_id: current_user.id, title: params[:question][:title], description: params[:question][:description])
    if @question.save